<template>
  <div class="p-8 h-full flex flex-col gap-5 animate-moving">
    <div class="flex justify-between">

      <label class="relative w-80">
        <span>Основной номер телефона</span>
        <div class="relative h-10 w-full flex items-center">
          <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 100 100" fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M11.7813 3.19369C12.8749 2.10175 14.188 1.25468 15.6337 0.708629C17.0795 0.162577 18.6247 -0.0699918 20.1671 0.0263345C21.7095 0.122661 23.2139 0.545683 24.5804 1.26737C25.947 1.98905 27.1445 2.99292 28.0938 4.21244L39.3125 18.6249C41.3688 21.2687 42.0938 24.7124 41.2813 27.9624L37.8625 41.6499C37.6858 42.3589 37.6953 43.1015 37.8902 43.8056C38.0852 44.5098 38.4589 45.1516 38.975 45.6687L54.3313 61.0249C54.849 61.5421 55.4918 61.9165 56.1972 62.1114C56.9026 62.3064 57.6464 62.3153 58.3563 62.1374L72.0375 58.7187C73.6414 58.3177 75.3154 58.2865 76.933 58.6276C78.5507 58.9687 80.0696 59.673 81.375 60.6874L95.7875 71.8999C100.969 75.9312 101.444 83.5874 96.8063 88.2187L90.3438 94.6812C85.7188 99.3062 78.8063 101.337 72.3625 99.0687C55.8699 93.2657 40.8955 83.8239 28.55 71.4437C16.1706 59.1 6.72881 44.1278 0.925014 27.6374C-1.33749 21.1999 0.693764 14.2812 5.31876 9.65619L11.7813 3.19369Z"
              fill="black" />
          </svg>
          <input v-maska data-maska="+998 ## ### ## ##" v-model="data.main_phone" @focus="data.main_phone = '+998 '"
            class="border px-2 w-full h-full rounded-r-md peer" placeholder="+998 ** *** ** **" type="text">
        </div>
      </label>

      <label class="relative w-80">
        <span>Дополнительный номер телефона</span>
        <div class="relative h-10 w-full flex items-center">
          <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 100 100" fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M11.7813 3.19369C12.8749 2.10175 14.188 1.25468 15.6337 0.708629C17.0795 0.162577 18.6247 -0.0699918 20.1671 0.0263345C21.7095 0.122661 23.2139 0.545683 24.5804 1.26737C25.947 1.98905 27.1445 2.99292 28.0938 4.21244L39.3125 18.6249C41.3688 21.2687 42.0938 24.7124 41.2813 27.9624L37.8625 41.6499C37.6858 42.3589 37.6953 43.1015 37.8902 43.8056C38.0852 44.5098 38.4589 45.1516 38.975 45.6687L54.3313 61.0249C54.849 61.5421 55.4918 61.9165 56.1972 62.1114C56.9026 62.3064 57.6464 62.3153 58.3563 62.1374L72.0375 58.7187C73.6414 58.3177 75.3154 58.2865 76.933 58.6276C78.5507 58.9687 80.0696 59.673 81.375 60.6874L95.7875 71.8999C100.969 75.9312 101.444 83.5874 96.8063 88.2187L90.3438 94.6812C85.7188 99.3062 78.8063 101.337 72.3625 99.0687C55.8699 93.2657 40.8955 83.8239 28.55 71.4437C16.1706 59.1 6.72881 44.1278 0.925014 27.6374C-1.33749 21.1999 0.693764 14.2812 5.31876 9.65619L11.7813 3.19369ZM78.125 6.24994C78.9538 6.24994 79.7487 6.57918 80.3347 7.16523C80.9208 7.75128 81.25 8.54614 81.25 9.37494V18.7499H90.625C91.4538 18.7499 92.2487 19.0792 92.8347 19.6652C93.4208 20.2513 93.75 21.0461 93.75 21.8749C93.75 22.7037 93.4208 23.4986 92.8347 24.0846C92.2487 24.6707 91.4538 24.9999 90.625 24.9999H81.25V34.3749C81.25 35.2037 80.9208 35.9986 80.3347 36.5846C79.7487 37.1707 78.9538 37.4999 78.125 37.4999C77.2962 37.4999 76.5014 37.1707 75.9153 36.5846C75.3293 35.9986 75 35.2037 75 34.3749V24.9999H65.625C64.7962 24.9999 64.0014 24.6707 63.4153 24.0846C62.8293 23.4986 62.5 22.7037 62.5 21.8749C62.5 21.0461 62.8293 20.2513 63.4153 19.6652C64.0014 19.0792 64.7962 18.7499 65.625 18.7499H75V9.37494C75 8.54614 75.3293 7.75128 75.9153 7.16523C76.5014 6.57918 77.2962 6.24994 78.125 6.24994Z"
              fill="black" />
          </svg>
          <input v-maska data-maska="+998 ## ### ## ##" v-model="data.additional_phone"
            @focus="data.additional_phone = '+998 '" class="border px-2 w-full h-full rounded-r-md peer"
            placeholder="+998 ** *** ** **" type="text">
        </div>
      </label>

      <label class="relative w-80">
        <span>Адресс электронной почты</span>
        <div class="relative h-10 w-full flex items-center">
          <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 100 76"
            fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M92.3619 0.842331L54.9081 36.2378C52.1082 38.7836 47.8832 38.7836 45.1416 36.2839L7.4585 0.896628C8.30849 0.663231 9.18348 0.500732 10.1085 0.500732H89.8911C90.7494 0.500732 91.566 0.638231 92.3619 0.842331ZM70.9209 32.5645L98.9041 6.12292C99.5791 7.48131 99.9998 8.9897 100 10.6063V65.3891C100 67.0099 99.5832 68.514 98.9041 69.8724L70.9209 32.5645ZM60.5692 42.3498C57.5401 45.1082 53.7568 46.4873 49.9777 46.4873C46.2236 46.4873 42.4737 45.1248 39.4862 42.4039L35.1737 38.3539L7.97803 75.262C8.66552 75.412 9.37391 75.4995 10.1071 75.4995H89.8899C90.7733 75.4995 91.619 75.3495 92.4358 75.1329L64.8276 38.3248L60.5692 42.3498ZM0 10.6055C0 9.05122 0.383395 7.59303 1.01249 6.27625L29.0582 32.6137L1.30839 70.2675C0.499996 68.8176 0 67.1676 0 65.3926V10.6055Z"
              fill="black" />
          </svg>
          <input v-model="data.email" :class="{ 'border-red-500': emailFlag }"
            class="border px-2 w-full h-full rounded-r-md peer" @focusout="handleEmailInput"
            placeholder="email@example.com" type="text">
        </div>
        <span class="absolute -bottom-5 left-14 text-sm text-red-400" v-show="emailFlag">Некорректный ввод</span>
      </label>

    </div>

    <div class="">

      <h3 class="text-lg font-semibold">Адресс постоянного проживания</h3>

      <div class="flex justify-between">
        <div class="w-[22rem] h-80">
          <YandexMap v-model:longitude="data.longitude" v-model:latitude="data.latitude" />
        </div>

        <div class="pt-2 grid grid-cols-2 gap-x-10">

          <label class="w-80">
            <span>Область</span>
            <div class="h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 100 100" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M46.2731 81.0303L44.5772 77.6387C39.0857 66.6474 33.5692 55.9933 26.5026 46.4187C21.9736 40.2688 20.0611 32.673 21.1236 25.0232C22.9194 12.115 33.6274 1.67363 46.594 0.198662C54.8979 -0.776319 63.2269 1.87343 69.4183 7.40243C75.6141 12.9355 79.1681 20.8688 79.1681 29.1686C79.1681 34.681 77.6139 40.0518 74.6723 44.7017L72.2762 48.4724C67.0704 56.6537 61.6876 65.1132 57.3227 73.847L53.7311 81.0303C53.023 82.4428 51.5812 83.3343 50.0021 83.3343C48.423 83.3343 46.9815 82.4428 46.2731 81.0303ZM62.5019 29.1688C62.5019 22.2773 56.8936 16.669 50.0021 16.669C43.1107 16.669 37.5024 22.2773 37.5024 29.1688C37.5024 36.0603 43.1107 41.6686 50.0021 41.6686C56.8936 41.6686 62.5019 36.0603 62.5019 29.1688ZM70.9412 64.234C71.4703 61.9965 73.7202 60.6008 75.9536 61.1424C91.4617 64.8174 99.999 71.2172 99.999 79.1671C99.999 92.8418 74.8454 100 50 100C25.1589 100 0.000976562 92.8418 0.000976562 79.1671C0.000976562 71.2172 8.53831 64.8174 24.0421 61.1424C26.2755 60.6007 28.5254 61.9965 29.0545 64.234C29.5879 66.4714 28.2045 68.7173 25.963 69.2464C13.03 72.3172 8.33421 76.8587 8.33421 79.1671C8.33421 84.1461 24.9546 91.6668 50 91.6668C75.0495 91.6668 91.6658 84.1461 91.6658 79.1671C91.6658 76.8587 86.9741 72.3172 74.0327 69.2464C71.7953 68.7173 70.4078 66.4714 70.9412 64.234Z"
                  fill="black" />
              </svg>

              <Dropdown :list="Object.keys(regionList)" :placeholder="'Выберите область'" :active="true"
                @select="selectRegion" />
            </div>
          </label>

          <label class="relative w-80">
            <span>Район / Город</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 100 100" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M46.2731 81.0303L44.5772 77.6387C39.0857 66.6474 33.5692 55.9933 26.5026 46.4187C21.9736 40.2688 20.0611 32.673 21.1236 25.0232C22.9194 12.115 33.6274 1.67363 46.594 0.198662C54.8979 -0.776319 63.2269 1.87343 69.4183 7.40243C75.6141 12.9355 79.1681 20.8688 79.1681 29.1686C79.1681 34.681 77.6139 40.0518 74.6723 44.7017L72.2762 48.4724C67.0704 56.6537 61.6876 65.1132 57.3227 73.847L53.7311 81.0303C53.023 82.4428 51.5812 83.3343 50.0021 83.3343C48.423 83.3343 46.9815 82.4428 46.2731 81.0303ZM62.5019 29.1688C62.5019 22.2773 56.8936 16.669 50.0021 16.669C43.1107 16.669 37.5024 22.2773 37.5024 29.1688C37.5024 36.0603 43.1107 41.6686 50.0021 41.6686C56.8936 41.6686 62.5019 36.0603 62.5019 29.1688ZM70.9412 64.234C71.4703 61.9965 73.7202 60.6008 75.9536 61.1424C91.4617 64.8174 99.999 71.2172 99.999 79.1671C99.999 92.8418 74.8454 100 50 100C25.1589 100 0.000976562 92.8418 0.000976562 79.1671C0.000976562 71.2172 8.53831 64.8174 24.0421 61.1424C26.2755 60.6007 28.5254 61.9965 29.0545 64.234C29.5879 66.4714 28.2045 68.7173 25.963 69.2464C13.03 72.3172 8.33421 76.8587 8.33421 79.1671C8.33421 84.1461 24.9546 91.6668 50 91.6668C75.0495 91.6668 91.6658 84.1461 91.6658 79.1671C91.6658 76.8587 86.9741 72.3172 74.0327 69.2464C71.7953 68.7173 70.4078 66.4714 70.9412 64.234Z"
                  fill="black" />
              </svg>

              <Dropdown :list='regionList[data.region]' :placeholder="'Выберите район/город'"
                :active="data.region !== ''" @select="selectDistrict" />
            </div>
          </label>

          <label class="relative w-80">
            <span>Махалля</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 100 100" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M46.2731 81.0303L44.5772 77.6387C39.0857 66.6474 33.5692 55.9933 26.5026 46.4187C21.9736 40.2688 20.0611 32.673 21.1236 25.0232C22.9194 12.115 33.6274 1.67363 46.594 0.198662C54.8979 -0.776319 63.2269 1.87343 69.4183 7.40243C75.6141 12.9355 79.1681 20.8688 79.1681 29.1686C79.1681 34.681 77.6139 40.0518 74.6723 44.7017L72.2762 48.4724C67.0704 56.6537 61.6876 65.1132 57.3227 73.847L53.7311 81.0303C53.023 82.4428 51.5812 83.3343 50.0021 83.3343C48.423 83.3343 46.9815 82.4428 46.2731 81.0303ZM62.5019 29.1688C62.5019 22.2773 56.8936 16.669 50.0021 16.669C43.1107 16.669 37.5024 22.2773 37.5024 29.1688C37.5024 36.0603 43.1107 41.6686 50.0021 41.6686C56.8936 41.6686 62.5019 36.0603 62.5019 29.1688ZM70.9412 64.234C71.4703 61.9965 73.7202 60.6008 75.9536 61.1424C91.4617 64.8174 99.999 71.2172 99.999 79.1671C99.999 92.8418 74.8454 100 50 100C25.1589 100 0.000976562 92.8418 0.000976562 79.1671C0.000976562 71.2172 8.53831 64.8174 24.0421 61.1424C26.2755 60.6007 28.5254 61.9965 29.0545 64.234C29.5879 66.4714 28.2045 68.7173 25.963 69.2464C13.03 72.3172 8.33421 76.8587 8.33421 79.1671C8.33421 84.1461 24.9546 91.6668 50 91.6668C75.0495 91.6668 91.6658 84.1461 91.6658 79.1671C91.6658 76.8587 86.9741 72.3172 74.0327 69.2464C71.7953 68.7173 70.4078 66.4714 70.9412 64.234Z"
                  fill="black" />
              </svg>
              <input v-model="data.mahalla" class="border px-2 w-full h-full rounded-r-md peer"
                placeholder="Введите название махалли" maxlength="30" type="text">
            </div>
          </label>

          <label class="relative w-80">
            <span>Улица</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 100 100" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M46.2731 81.0303L44.5772 77.6387C39.0857 66.6474 33.5692 55.9933 26.5026 46.4187C21.9736 40.2688 20.0611 32.673 21.1236 25.0232C22.9194 12.115 33.6274 1.67363 46.594 0.198662C54.8979 -0.776319 63.2269 1.87343 69.4183 7.40243C75.6141 12.9355 79.1681 20.8688 79.1681 29.1686C79.1681 34.681 77.6139 40.0518 74.6723 44.7017L72.2762 48.4724C67.0704 56.6537 61.6876 65.1132 57.3227 73.847L53.7311 81.0303C53.023 82.4428 51.5812 83.3343 50.0021 83.3343C48.423 83.3343 46.9815 82.4428 46.2731 81.0303ZM62.5019 29.1688C62.5019 22.2773 56.8936 16.669 50.0021 16.669C43.1107 16.669 37.5024 22.2773 37.5024 29.1688C37.5024 36.0603 43.1107 41.6686 50.0021 41.6686C56.8936 41.6686 62.5019 36.0603 62.5019 29.1688ZM70.9412 64.234C71.4703 61.9965 73.7202 60.6008 75.9536 61.1424C91.4617 64.8174 99.999 71.2172 99.999 79.1671C99.999 92.8418 74.8454 100 50 100C25.1589 100 0.000976562 92.8418 0.000976562 79.1671C0.000976562 71.2172 8.53831 64.8174 24.0421 61.1424C26.2755 60.6007 28.5254 61.9965 29.0545 64.234C29.5879 66.4714 28.2045 68.7173 25.963 69.2464C13.03 72.3172 8.33421 76.8587 8.33421 79.1671C8.33421 84.1461 24.9546 91.6668 50 91.6668C75.0495 91.6668 91.6658 84.1461 91.6658 79.1671C91.6658 76.8587 86.9741 72.3172 74.0327 69.2464C71.7953 68.7173 70.4078 66.4714 70.9412 64.234Z"
                  fill="black" />
              </svg>
              <input v-model="data.street" class="border px-2 w-full h-full rounded-r-md peer"
                placeholder="ул. название улицы" type="text">
            </div>
          </label>

          <label class="relative w-80">
            <span>Номер здания</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 100 100" fill="none">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M46.2731 81.0303L44.5772 77.6387C39.0857 66.6474 33.5692 55.9933 26.5026 46.4187C21.9736 40.2688 20.0611 32.673 21.1236 25.0232C22.9194 12.115 33.6274 1.67363 46.594 0.198662C54.8979 -0.776319 63.2269 1.87343 69.4183 7.40243C75.6141 12.9355 79.1681 20.8688 79.1681 29.1686C79.1681 34.681 77.6139 40.0518 74.6723 44.7017L72.2762 48.4724C67.0704 56.6537 61.6876 65.1132 57.3227 73.847L53.7311 81.0303C53.023 82.4428 51.5812 83.3343 50.0021 83.3343C48.423 83.3343 46.9815 82.4428 46.2731 81.0303ZM62.5019 29.1688C62.5019 22.2773 56.8936 16.669 50.0021 16.669C43.1107 16.669 37.5024 22.2773 37.5024 29.1688C37.5024 36.0603 43.1107 41.6686 50.0021 41.6686C56.8936 41.6686 62.5019 36.0603 62.5019 29.1688ZM70.9412 64.234C71.4703 61.9965 73.7202 60.6008 75.9536 61.1424C91.4617 64.8174 99.999 71.2172 99.999 79.1671C99.999 92.8418 74.8454 100 50 100C25.1589 100 0.000976562 92.8418 0.000976562 79.1671C0.000976562 71.2172 8.53831 64.8174 24.0421 61.1424C26.2755 60.6007 28.5254 61.9965 29.0545 64.234C29.5879 66.4714 28.2045 68.7173 25.963 69.2464C13.03 72.3172 8.33421 76.8587 8.33421 79.1671C8.33421 84.1461 24.9546 91.6668 50 91.6668C75.0495 91.6668 91.6658 84.1461 91.6658 79.1671C91.6658 76.8587 86.9741 72.3172 74.0327 69.2464C71.7953 68.7173 70.4078 66.4714 70.9412 64.234Z"
                  fill="black" />
              </svg>
              <input v-model="data.apartment" class="border px-2 w-full h-full rounded-r-md peer"
                placeholder="номер квартиры/дома (*букву)" type="text">
            </div>
          </label>

        </div>
      </div>

    </div>
  </div>
</template>

<script lang="ts" setup>

const data = defineModel<ContactDetails>({ required: true });

// const data = ref<ContactDetails>({
//   main_phone: '',
//   additional_phone: '',
//   email: '',
//   latitude: 0,
//   longitude: 0,
//   region: '',
//   district: '',
//   mahalla: '',
//   street: '',
//   apartment: '',
// });

const emailFlag = ref(false);

const selectRegion = (region: string) => {
  data.value.region = region;
}

const selectDistrict = (district: string) => {
  data.value.district = district;
}

const handleEmailInput = (e: Event) => {
  if (data.value.email.length === 0) emailFlag.value = false;
  else emailFlag.value = !/^([a-z\d\.-]+)@([a-z\d-]+)\.([a-z){2,8})(\.[a-z]){2,8}?$/.test(data.value.email);
}

const regionList: Record<string, Array<string>> = {
  'Кашкадарьинская область': [
    'Гузарский район',
    'Дехканабадский район',
    'Камашинский район',
    'Каршинский район',
    'Касанский район',
    'Касбийский район',
    'Китабский район',
    'Миришкорский район',
    'Мубарекский район',
    'Нишанский район',
    'Чиракчинский район',
    'Шахрисабзский район',
    'Яккабагский район',
    'город Карши',
  ],
  'Навоийская область': [
    'Канимехский район',
    'Карманинский район',
    'Кызылтепинский район',
    'Навбахорский район',
    'Нуратинский район',
    'Тамдынский район',
    'Учкудукский район',
    'Хатырчинский район',
    'город Зарафшан',
    'город Навои',
  ],
  'Наманганская область': [
    'Касансайский район',
    'Мингбулакский район',
    'Наманганский район',
    'Нарынский район',
    'Папский район',
    'Туракурганский район',
    'Уйчинский район',
    'Учкурганский район',
    'Чартакский район',
    'Чустский район',
    'Янгикурганский район',
    'город Наманган',
  ],
  'Самаркандская область': [
    'Акдарьинский район',
    'Булунгурский район',
    'Джамбайский район',
    'Иштыханский район',
    'Каттакурганский район',
    'Кошрабадский район',
    'Нарпайский район',
    'Нурабадский район',
    'Пайарыкский район',
    'Пастдаргомский район',
    'Пахтачийский район',
    'Самаркандский район',
    'Тайлакский район',
    'Ургутский район',
    'город Каттакурган',
    'город Самарканд',
  ],
  'Сурхандарьинская область': [
    'Алтынсайский район',
    'Ангорский район',
    'Байсунский район',
    'Бандиханский район',
    'Денауский район',
    'Джаркурганский район',
    'Кизирикский район',
    'Кумкурганский район',
    'Музрабадский район',
    'Сариасийский район',
    'Термезский район',
    'Узунский район',
    'Шерабадский район',
    'Шурчинский район',
    'город Термез',
  ],
  'Сырдарьинская область': [
    'Акалтынский район',
    'Баяутский район',
    'Гулистанский район',
    'Мирзаабадский район',
    'Сайхунабадский район',
    'Сардобский район',
    'Сырдарьинский район',
    'Хавастский район',
    'город Гулистан',
    'город Ширин',
    'город Янгиер',
  ],
  'Город Ташкент': [
    'Алмазарский район',
    'Бектемирский район',
    'Мирабадский район',
    'Мирзо-Улугбекский район',
    'Сергелийский район',
    'Учтепинский район',
    'Яшнабадский район',
    'Чиланзарский район',
    'Шайхантахурский район',
    'Юнусабадский район',
    'Яккасарайский район',
  ],
  'Ташкентская область': [
    'Аккурганский район',
    'Ахангаранский район',
    'Бекабадский район',
    'Бостанлыкский район',
    'Букинский район',
    'Зангиатинский район',
    'Кибрайский район',
    'Куйичирчикский район',
    'Паркентский район',
    'Пскентский район',
    'Ташкентский район',
    'Уртачирчикский район',
    'Чиназский район',
    'Юкоричирчикский район',
    'Янгиюльский район',
    'город Алмалык',
    'город Ангрен',
    'город Бекабад',
    'город Чирчик',
  ],
  'Ферганская область': [
    'Алтыарыкский район',
    'Багдадский район',
    'Бешарыкский район',
    'Бувайдинский район',
    'Дангаринский район',
    'Кувинский район',
    'Куштепинский район',
    'Риштанский район',
    'Сохский район',
    'Ташлакский район',
    'Узбекистанский район',
    'Учкуприкский район',
    'Ферганский район',
    'Фуркатский район',
    'Язъяванский район',
    'город Коканд',
    'город Кувасай',
    'город Маргилан',
    'город Фергана',
  ],
  'Хорезмская область': [
    'Багатский район',
    'Гурленский район',
    'Кошкупырский район',
    'Ургенчский район',
    'Хазараспский район',
    'Ханкинский район',
    'Хивинский район',
    'Шаватский район',
    'Янгиарыкский район',
    'Янгибазарский район',
    'город Ургенч',
  ],
  'Республика Каракалпакистан': [
    'Амударьинский район',
    'Берунийский район',
    'Караузякский район',
    'Кегейлийский район',
    'Кунградский район',
    'Канлыкульский район',
    'Муйнакский район',
    'Нукусский район',
    'Тахиаташский район',
    'Тахтакупырский район',
    'Турткульский район',
    'Ходжейлийский район',
    'Чимбайский район',
    'Шуманайский район',
    'Элликкалинский район',
    'город Нукус',
  ],
  'Андижанская область': [
    'Алтынкульский район',
    'Андижанский район',
    'Асакинский район',
    'Балыкчинский район',
    'Бозский район',
    'Булакбашинский район',
    'Джалакудукский район',
    'Избасканский район',
    'Кургантепинский район',
    'Мархаматский район',
    'Пахтаабадский район',
    'Улугнорский район',
    'Ходжаабадский район',
    'Шахриханский район',
    'город Андижан',
    'город Ханабад',
  ],
  'Бухарская область': [
    'Алатский район',
    'Бухарский район',
    'Вабкентский район',
    'Гиждуванский район',
    'Жондорский район',
    'Каганский район',
    'Каракульский район',
    'Караулбазарский район',
    'Пешкунский район',
    'Ромитанский район',
    'Шафирканский район',
    'город Бухара',
    'город Каган',
  ],
  'Джизакская область': [
    'Арнасайский район',
    'Бахмальский район',
    'Галляаральский район',
    'Дустликский район',
    'Зааминский район',
    'Зарбдарский район',
    'Зафарабадский район',
    'Мирзачульский район',
    'Пахтакорский район',
    'Фаришский район',
    'Шараф-Рашидовский район',
    'Янгиабадский район',
    'город Джизак',
  ],
};

</script>

<style></style>