<template>
  <div class="p-12 h-full flex flex-col animate-moving">

    <div class="space-y-7">
      <div class="flex items-center">

        <div class="h-full w-72 flex flex-col items-center gap-2">
          <UploadPhoto class="mt-2 w-48 h-52" />
        </div>

        <div class="h-full w-full grid grid-cols-2 justify-items-end items-start gap-y-10">

          <label class="relative w-80">
            <span>Фамилия</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" viewBox="0 0 84 100" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M68.2179 32.4998C68.2179 46.9791 56.4821 58.7189 42.0009 58.7189C27.5177 58.7189 15.7798 46.9791 15.7798 32.5V26.2191C15.7798 11.7398 27.5175 0 42.0009 0C56.4821 0 68.2179 11.7398 68.2179 26.2189V32.4998ZM61.873 60.7002C71.7314 64.932 77.7869 72.3762 81.4841 78.9484C86.3884 87.6656 82.5435 100 74.0623 100H9.93785C1.4564 100 -2.38852 87.6656 2.51558 78.9484C6.2107 72.3764 12.2664 64.932 22.1246 60.7002C27.763 64.6449 34.6127 66.9672 42.0009 66.9672C49.3851 66.9672 56.2347 64.6447 61.873 60.7002Z"
                  fill="#000" stroke="#000" stroke-width="0.195312" />
              </svg>
              <input v-model="data.last_name" class="border px-2 w-full h-full rounded-r-md peer"
                @input="changeFullNameFields" placeholder="Введите фамилию"
                pattern="^([a-zA-Z]{0,20})|([а-яА-Я]{0,30})$" type="text">
            </div>
            <!-- <span class="ml-12 text-sm  text-red-400" v-show="nameInFullFlag">Некорректный ввод</span> -->
            <span class="absolute -bottom-5 left-14 text-sm text-red-400" v-show="nameInFullFlag">Некорректный
              ввод</span>

          </label>

          <label class="relative w-80">
            <span>Имя</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" viewBox="0 0 84 100" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M68.2179 32.4998C68.2179 46.9791 56.4821 58.7189 42.0009 58.7189C27.5177 58.7189 15.7798 46.9791 15.7798 32.5V26.2191C15.7798 11.7398 27.5175 0 42.0009 0C56.4821 0 68.2179 11.7398 68.2179 26.2189V32.4998ZM61.873 60.7002C71.7314 64.932 77.7869 72.3762 81.4841 78.9484C86.3884 87.6656 82.5435 100 74.0623 100H9.93785C1.4564 100 -2.38852 87.6656 2.51558 78.9484C6.2107 72.3764 12.2664 64.932 22.1246 60.7002C27.763 64.6449 34.6127 66.9672 42.0009 66.9672C49.3851 66.9672 56.2347 64.6447 61.873 60.7002Z"
                  fill="#000" stroke="#000" stroke-width="0.195312" />
              </svg>
              <input v-model="data.first_name" class="border px-2 w-full h-full rounded-r-md peer"
                @input="changeFullNameFields" placeholder="Введите имя" pattern="^([a-zA-Z]{0,20})|([а-яА-Я]{0,30})$"
                type="text">
            </div>
            <!-- <span class="ml-12 text-sm text-red-400" v-show="nameInFullFlag">Некорректный ввод</span> -->
            <span class="absolute -bottom-5 left-14 text-sm text-red-400" v-show="nameInFullFlag">Некорректный
              ввод</span>

          </label>

          <label class="relative w-80">
            <span>Отчество</span>
            <div class="relative h-10 w-full flex items-center">
              <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" viewBox="0 0 84 100" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M68.2179 32.4998C68.2179 46.9791 56.4821 58.7189 42.0009 58.7189C27.5177 58.7189 15.7798 46.9791 15.7798 32.5V26.2191C15.7798 11.7398 27.5175 0 42.0009 0C56.4821 0 68.2179 11.7398 68.2179 26.2189V32.4998ZM61.873 60.7002C71.7314 64.932 77.7869 72.3762 81.4841 78.9484C86.3884 87.6656 82.5435 100 74.0623 100H9.93785C1.4564 100 -2.38852 87.6656 2.51558 78.9484C6.2107 72.3764 12.2664 64.932 22.1246 60.7002C27.763 64.6449 34.6127 66.9672 42.0009 66.9672C49.3851 66.9672 56.2347 64.6447 61.873 60.7002Z"
                  fill="#000" stroke="#000" stroke-width="0.195312" />
              </svg>
              <input v-model="data.middle_name" class="border px-2 w-full h-full rounded-r-md peer"
                @input="changeFullNameFields" placeholder="Введите отчество"
                pattern="^([a-zA-Z]{0,20})|([а-яА-Я]{0,30})$" type="text">
            </div>
            <!-- <span class="ml-12 text-sm text-red-400" v-show="nameInFullFlag">Некорректный ввод</span> -->
            <span class="absolute -bottom-5 left-14 text-sm text-red-400" v-show="nameInFullFlag">Некорректный
              ввод</span>

          </label>

          <div class="w-80">
            <vue-tailwind-datepicker class="max-w-80" v-model="data.birth_date" v-slot="{ placeholder }" as-single
              :formatter="{
                date: 'DD.MM.YYYY',
                month: 'MMM',
              }">
              <label class="relative w-full">
                <span>Дата рождения</span>
                <div class="relative h-10 w-full flex items-center">
                  <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 100 100" fill="none">
                    <path
                      d="M29.1665 8.33337C31.4677 8.33337 33.3332 10.1989 33.3332 12.5V20.8334H66.6668V12.5C66.6668 10.1989 68.5323 8.33337 70.8335 8.33337C73.1347 8.33337 75.0002 10.1989 75.0002 12.5V20.8334C82.8568 20.8334 86.7852 20.8334 89.226 23.2742C91.6668 25.715 91.6668 29.6433 91.6668 37.5001C91.6668 39.4642 91.6668 40.4464 91.0568 41.0565C90.4464 41.6667 89.4643 41.6667 87.5002 41.6667H12.5002C10.536 41.6667 9.55387 41.6667 8.9437 41.0565C8.3335 40.4464 8.3335 39.4642 8.3335 37.5001C8.3335 29.6433 8.3335 25.715 10.7743 23.2742C13.215 20.8334 17.1433 20.8334 24.9998 20.8334V12.5C24.9998 10.1989 26.8653 8.33337 29.1665 8.33337Z"
                      fill="black" />
                    <path fill-rule="evenodd" clip-rule="evenodd"
                      d="M10.7743 89.2259C8.3335 86.785 8.3335 82.8567 8.3335 75V54.1667C8.3335 52.2025 8.3335 51.2205 8.9437 50.61C9.55387 50 10.536 50 12.5002 50H87.5002C89.4643 50 90.4464 50 91.0568 50.61C91.6668 51.2205 91.6668 52.2025 91.6668 54.1667V75C91.6668 82.8567 91.6668 86.785 89.226 89.2259C86.7852 91.6667 82.8568 91.6667 75.0002 91.6667H25.0002C17.1434 91.6667 13.215 91.6667 10.7743 89.2259ZM29.777 58.9434C29.1668 59.5538 29.1668 60.5359 29.1668 62.5C29.1668 64.4642 29.1668 65.4463 29.777 66.0567C30.3872 66.6667 31.3693 66.6667 33.3335 66.6667H41.6668C43.631 66.6667 44.6131 66.6667 45.2235 66.0567C45.8335 65.4463 45.8335 64.4642 45.8335 62.5C45.8335 60.5359 45.8335 59.5538 45.2235 58.9434C44.6131 58.3334 43.631 58.3334 41.6668 58.3334H33.3335C31.3693 58.3334 30.3872 58.3334 29.777 58.9434ZM29.1668 79.1667C29.1668 77.2025 29.1668 76.2205 29.777 75.61C30.3872 75 31.3693 75 33.3335 75H41.6668C43.631 75 44.6131 75 45.2235 75.61C45.8335 76.2205 45.8335 77.2025 45.8335 79.1667C45.8335 81.1309 45.8335 82.113 45.2235 82.7234C44.6131 83.3334 43.631 83.3334 41.6668 83.3334H33.3335C31.3693 83.3334 30.3872 83.3334 29.777 82.7234C29.1668 82.113 29.1668 81.1309 29.1668 79.1667ZM54.7768 58.9434C54.1668 59.5538 54.1668 60.5359 54.1668 62.5C54.1668 64.4642 54.1668 65.4463 54.7768 66.0567C55.3872 66.6667 56.3693 66.6667 58.3335 66.6667H66.6668C68.631 66.6667 69.6131 66.6667 70.2235 66.0567C70.8335 65.4463 70.8335 64.4642 70.8335 62.5C70.8335 60.5359 70.8335 59.5538 70.2235 58.9434C69.6131 58.3334 68.631 58.3334 66.6668 58.3334H58.3335C56.3693 58.3334 55.3872 58.3334 54.7768 58.9434ZM54.1668 79.1667C54.1668 77.2025 54.1668 76.2205 54.7768 75.61C55.3872 75 56.3693 75 58.3335 75H66.6668C68.631 75 69.6131 75 70.2235 75.61C70.8335 76.2205 70.8335 77.2025 70.8335 79.1667C70.8335 81.1309 70.8335 82.113 70.2235 82.7234C69.6131 83.3334 68.631 83.3334 66.6668 83.3334H58.3335C56.3693 83.3334 55.3872 83.3334 54.7768 82.7234C54.1668 82.113 54.1668 81.1309 54.1668 79.1667Z"
                      fill="black" />
                  </svg>
                  <input @focusout="handleDateFocusout" v-maska data-maska="##.##.####" v-model="data.birth_date"
                    :class="{ 'border-red-500': dateFlag }" class="border px-2 w-full h-full rounded-r-md outline-none"
                    :placeholder="placeholder" maxlength="10" type="text">
                </div>

              </label>

            </vue-tailwind-datepicker>
            <span v-show="dateFlag" class="ml-12 text-sm text-red-400">
              Некорректный ввод
            </span>
          </div>

        </div>
      </div>

      <div class="flex justify-between">

        <div class="relative w-56 mb-8">
          <span>Пол</span>
          <button @click="clickDropdown" class="relative h-10 w-full flex items-center">
            <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" viewBox="0 0 84 100" fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M68.2179 32.4998C68.2179 46.9791 56.4821 58.7189 42.0009 58.7189C27.5177 58.7189 15.7798 46.9791 15.7798 32.5V26.2191C15.7798 11.7398 27.5175 0 42.0009 0C56.4821 0 68.2179 11.7398 68.2179 26.2189V32.4998ZM61.873 60.7002C71.7314 64.932 77.7869 72.3762 81.4841 78.9484C86.3884 87.6656 82.5435 100 74.0623 100H9.93785C1.4564 100 -2.38852 87.6656 2.51558 78.9484C6.2107 72.3764 12.2664 64.932 22.1246 60.7002C27.763 64.6449 34.6127 66.9672 42.0009 66.9672C49.3851 66.9672 56.2347 64.6447 61.873 60.7002Z"
                fill="#000" stroke="#000" stroke-width="0.195312" />
            </svg>
            <!-- <select class="px-2 w-full h-full rounded-r-md peer" placeholder="Введите свою фамилию" type="text">
              <option value="male">Мужской</option>
              <option value="female">Женский</option>
            </select> -->
            <span
              class="border leading-10 px-2 w-full h-full text-start rounded-r-md bg-white">{{ data.gender === 'MALE' ? 'Мужской' : data.gender === 'FEMALE' ? 'Женский' : 'Выберите пол' }}</span>
            <svg :class="dropdown ? 'rotate-90' : 'rotate-0'"
              class="h-[1.3rem] w-[1.3rem] absolute right-2 fill-[#191D23] dark:fill-white transition-transform"
              xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" fill="none">
              <path fill="#191D23" fill-rule="evenodd" clip-rule="evenodd"
                d="M7.29308 14.707C7.10561 14.5194 7.00029 14.2651 7.00029 14C7.00029 13.7348 7.10561 13.4805 7.29308 13.293L10.5861 9.99997L7.29308 6.70697C7.19757 6.61472 7.12139 6.50438 7.06898 6.38237C7.01657 6.26037 6.98898 6.12915 6.98783 5.99637C6.98668 5.86359 7.01198 5.73191 7.06226 5.60902C7.11254 5.48612 7.18679 5.37447 7.28069 5.28057C7.37458 5.18668 7.48623 5.11243 7.60913 5.06215C7.73202 5.01187 7.8637 4.98656 7.99648 4.98772C8.12926 4.98887 8.26048 5.01646 8.38249 5.06887C8.50449 5.12128 8.61483 5.19746 8.70708 5.29297L12.7071 9.29297C12.8946 9.4805 12.9999 9.73481 12.9999 9.99997C12.9999 10.2651 12.8946 10.5194 12.7071 10.707L8.70708 14.707C8.51955 14.8944 8.26525 14.9998 8.00008 14.9998C7.73492 14.9998 7.48061 14.8944 7.29308 14.707Z" />
            </svg>

            <div :class="{ 'hidden': !dropdown }"
              class="transition-all z-10 absolute top-12 right-1 w-44 rounded-md shadow-md overflow-hidden divide-y-2 bg-white">
              <p @click="selectOption('MALE')" class="flex items-center gap-4 py-2 px-4 hover:bg-gray-200">
                <svg class="py-1 h-8" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 74 100" fill="none">
                  <path
                    d="M50.0773 62.7205C49.0059 60.7594 48.8338 58.7431 49.0139 57.0121C52.0283 54.4609 54.3033 50.6666 56.1459 45.6594C58.8307 44.2566 60.6922 41.2443 60.6922 37.7441C60.6922 35.5955 59.9902 33.6303 58.8287 32.1062L58.9359 31.1584C59.9941 27.151 62.907 13.1277 53.9498 6.55896C49.2783 0.719121 42.9711 -0.215059 35.9631 0.485722C32.4768 0.834159 29.126 1.87225 26.45 1.48357C23.3814 1.03748 20.8271 0.392753 20.0787 0.0183391C19.6473 -0.198067 18.417 1.5156 17.1123 4.37303C14.5248 10.0404 12.9947 19.7959 14.6045 28.5972L15.002 32.1047C13.8398 33.6287 13.1373 35.5947 13.1373 37.7439C13.1373 41.1595 14.91 44.1115 17.4902 45.556C19.3012 50.8045 21.741 54.7133 25.017 57.2814C25.1506 58.95 24.9396 60.8615 23.9229 62.7201C21.9195 66.3887 0.541992 71.3137 0.541992 91.4699C0.541992 94.5783 10.9584 100 37.0002 100C63.0424 100 73.4584 94.5783 73.4584 91.4699C73.4584 71.3137 52.0812 66.3887 50.0773 62.7205Z"
                    fill="black" />
                </svg>
                <span>
                  Мужcкой
                </span>
              </p>
              <p @click="selectOption('FEMALE')" class="flex items-center gap-4 py-2 px-4 hover:bg-gray-200">
                <svg class="py-1 h-8" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 78 100" fill="none">
                  <path
                    d="M49.3034 64.0963C49.1722 62.835 49.1821 61.5703 49.269 60.3643C53.0497 62.7082 57.0651 62.0287 57.0651 62.0287C57.0651 62.0287 55.0425 57.7498 55.5263 52.0051C56.4905 50.1279 57.3526 48.0311 58.1313 45.7619C59.9673 44.5578 61.6341 42.4074 62.521 38.4803C62.8673 36.9479 62.5958 35.4926 61.9335 34.2246C69.3608 10.1262 53.8216 0 44.4534 0C42.6792 0 40.8241 0.168945 39.0003 0.490039C37.1745 0.168945 35.3198 0 33.5456 0C24.1771 0 8.6376 10.1266 16.0659 34.2262C15.404 35.4938 15.1331 36.9484 15.4792 38.4803C16.5782 43.3479 18.8761 45.4836 21.2089 46.4719C24.3534 54.773 20.9339 62.0287 20.9339 62.0287C20.9339 62.0287 24.9497 62.7084 28.7312 60.3637C28.8181 61.5699 28.828 62.8348 28.6968 64.0965C27.4425 76.1766 0.634277 75.1238 0.634277 91.0242C0.634277 94.2953 11.5958 100 39.0003 100C66.4044 100 77.3659 94.2953 77.3659 91.0242C77.3659 75.1236 50.5581 76.1764 49.3034 64.0963Z"
                    fill="black" />
                </svg>
                <span>
                  Женский
                </span>
              </p>
            </div>
          </button>
        </div>


        <label class="relative w-80">
          <span>Серия и номер паспорта / ID-карты</span>
          <div class="relative h-10 w-full flex items-center">
            <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 100 100" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M20.8335 20.8333C20.8335 19.1389 19.8221 17.6808 18.3701 17.0296C18.9698 16.5573 19.6965 16.234 20.4985 16.1194L65.4885 9.69225C70.5085 8.97508 75.0002 12.8706 75.0002 17.9418V21.3584C73.6685 21.0156 72.2722 20.8333 70.8335 20.8333H20.8335ZM40.625 54.1666C40.625 48.9891 44.8225 44.7916 50 44.7916C55.1775 44.7916 59.375 48.9891 59.375 54.1666C59.375 59.3441 55.1775 63.5416 50 63.5416C44.8225 63.5416 40.625 59.3441 40.625 54.1666ZM83.3332 37.5C83.3332 32.0575 79.8548 27.4273 74.9998 25.7113C73.6965 25.2507 72.294 25 70.8332 25H20.8332C19.2909 25 17.9444 24.1621 17.2239 22.9167C16.8694 22.3038 16.6665 21.5923 16.6665 20.8334V79.1667C16.6665 86.0705 22.263 91.6667 29.1665 91.6667H70.8332C77.7369 91.6667 83.3332 86.0705 83.3332 79.1667V37.5ZM34.3748 54.1667C34.3748 45.5371 41.3704 38.5417 49.9998 38.5417C58.6294 38.5417 65.6248 45.5371 65.6248 54.1667C65.6248 62.7963 58.6294 69.7917 49.9998 69.7917C41.3704 69.7917 34.3748 62.7963 34.3748 54.1667ZM38.5415 79.1667C38.5415 77.4409 39.9406 76.0417 41.6665 76.0417H58.3332C60.059 76.0417 61.4582 77.4409 61.4582 79.1667C61.4582 80.8925 60.059 82.2917 58.3332 82.2917H41.6665C39.9406 82.2917 38.5415 80.8925 38.5415 79.1667Z"
                fill="black" />
            </svg>
            <input v-maska:[options] class="border px-2 w-full h-full rounded-r-md peer" data-maska="ss #######"
              data-maska-tokens="s:[A-Z]" placeholder="AA 0000000" v-model="data.series_and_number" maxlength="10"
              type="text">
          </div>
        </label>

        <label class="relative w-80">
          <span>ПИНФЛ</span>
          <div class="relative h-10 w-full flex items-center">
            <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 100 100" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M20.8335 20.8333C20.8335 19.1389 19.8221 17.6808 18.3701 17.0296C18.9698 16.5573 19.6965 16.234 20.4985 16.1194L65.4885 9.69225C70.5085 8.97508 75.0002 12.8706 75.0002 17.9418V21.3584C73.6685 21.0156 72.2722 20.8333 70.8335 20.8333H20.8335ZM40.625 54.1666C40.625 48.9891 44.8225 44.7916 50 44.7916C55.1775 44.7916 59.375 48.9891 59.375 54.1666C59.375 59.3441 55.1775 63.5416 50 63.5416C44.8225 63.5416 40.625 59.3441 40.625 54.1666ZM83.3332 37.5C83.3332 32.0575 79.8548 27.4273 74.9998 25.7113C73.6965 25.2507 72.294 25 70.8332 25H20.8332C19.2909 25 17.9444 24.1621 17.2239 22.9167C16.8694 22.3038 16.6665 21.5923 16.6665 20.8334V79.1667C16.6665 86.0705 22.263 91.6667 29.1665 91.6667H70.8332C77.7369 91.6667 83.3332 86.0705 83.3332 79.1667V37.5ZM34.3748 54.1667C34.3748 45.5371 41.3704 38.5417 49.9998 38.5417C58.6294 38.5417 65.6248 45.5371 65.6248 54.1667C65.6248 62.7963 58.6294 69.7917 49.9998 69.7917C41.3704 69.7917 34.3748 62.7963 34.3748 54.1667ZM38.5415 79.1667C38.5415 77.4409 39.9406 76.0417 41.6665 76.0417H58.3332C60.059 76.0417 61.4582 77.4409 61.4582 79.1667C61.4582 80.8925 60.059 82.2917 58.3332 82.2917H41.6665C39.9406 82.2917 38.5415 80.8925 38.5415 79.1667Z"
                fill="black" />
            </svg>
            <input v-maska data-maska="##############" v-model="data.pinfl"
              class="border px-2 w-full h-full rounded-r-md peer" placeholder="12345678901234" type="text">
          </div>
        </label>

      </div>

    </div>

    <!-- <div class="flex gap-11 pt-3">

      <vue-tailwind-datepicker class="max-w-96" v-model="datePassportExpiration.gV" v-slot="{ placeholder }" :formatter="{
            date: 'DD/MM/YYYY',
            month: 'MMM',
          }" separator=" ~ " :shortcuts="false">

        <label class="relative">
          <span>Дата выдачи / Срок годность</span>
          <div class="relative h-10 w-full flex items-center">
            <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 100 100" fill="none">
              <path
                d="M29.1665 8.33337C31.4677 8.33337 33.3332 10.1989 33.3332 12.5V20.8334H66.6668V12.5C66.6668 10.1989 68.5323 8.33337 70.8335 8.33337C73.1347 8.33337 75.0002 10.1989 75.0002 12.5V20.8334C82.8568 20.8334 86.7852 20.8334 89.226 23.2742C91.6668 25.715 91.6668 29.6433 91.6668 37.5001C91.6668 39.4642 91.6668 40.4464 91.0568 41.0565C90.4464 41.6667 89.4643 41.6667 87.5002 41.6667H12.5002C10.536 41.6667 9.55387 41.6667 8.9437 41.0565C8.3335 40.4464 8.3335 39.4642 8.3335 37.5001C8.3335 29.6433 8.3335 25.715 10.7743 23.2742C13.215 20.8334 17.1433 20.8334 24.9998 20.8334V12.5C24.9998 10.1989 26.8653 8.33337 29.1665 8.33337Z"
                fill="black" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M10.7743 89.2259C8.3335 86.785 8.3335 82.8567 8.3335 75V54.1667C8.3335 52.2025 8.3335 51.2205 8.9437 50.61C9.55387 50 10.536 50 12.5002 50H87.5002C89.4643 50 90.4464 50 91.0568 50.61C91.6668 51.2205 91.6668 52.2025 91.6668 54.1667V75C91.6668 82.8567 91.6668 86.785 89.226 89.2259C86.7852 91.6667 82.8568 91.6667 75.0002 91.6667H25.0002C17.1434 91.6667 13.215 91.6667 10.7743 89.2259ZM29.777 58.9434C29.1668 59.5538 29.1668 60.5359 29.1668 62.5C29.1668 64.4642 29.1668 65.4463 29.777 66.0567C30.3872 66.6667 31.3693 66.6667 33.3335 66.6667H41.6668C43.631 66.6667 44.6131 66.6667 45.2235 66.0567C45.8335 65.4463 45.8335 64.4642 45.8335 62.5C45.8335 60.5359 45.8335 59.5538 45.2235 58.9434C44.6131 58.3334 43.631 58.3334 41.6668 58.3334H33.3335C31.3693 58.3334 30.3872 58.3334 29.777 58.9434ZM29.1668 79.1667C29.1668 77.2025 29.1668 76.2205 29.777 75.61C30.3872 75 31.3693 75 33.3335 75H41.6668C43.631 75 44.6131 75 45.2235 75.61C45.8335 76.2205 45.8335 77.2025 45.8335 79.1667C45.8335 81.1309 45.8335 82.113 45.2235 82.7234C44.6131 83.3334 43.631 83.3334 41.6668 83.3334H33.3335C31.3693 83.3334 30.3872 83.3334 29.777 82.7234C29.1668 82.113 29.1668 81.1309 29.1668 79.1667ZM54.7768 58.9434C54.1668 59.5538 54.1668 60.5359 54.1668 62.5C54.1668 64.4642 54.1668 65.4463 54.7768 66.0567C55.3872 66.6667 56.3693 66.6667 58.3335 66.6667H66.6668C68.631 66.6667 69.6131 66.6667 70.2235 66.0567C70.8335 65.4463 70.8335 64.4642 70.8335 62.5C70.8335 60.5359 70.8335 59.5538 70.2235 58.9434C69.6131 58.3334 68.631 58.3334 66.6668 58.3334H58.3335C56.3693 58.3334 55.3872 58.3334 54.7768 58.9434ZM54.1668 79.1667C54.1668 77.2025 54.1668 76.2205 54.7768 75.61C55.3872 75 56.3693 75 58.3335 75H66.6668C68.631 75 69.6131 75 70.2235 75.61C70.8335 76.2205 70.8335 77.2025 70.8335 79.1667C70.8335 81.1309 70.8335 82.113 70.2235 82.7234C69.6131 83.3334 68.631 83.3334 66.6668 83.3334H58.3335C56.3693 83.3334 55.3872 83.3334 54.7768 82.7234C54.1668 82.113 54.1668 81.1309 54.1668 79.1667Z"
                fill="black" />
            </svg>
            <input v-maska data-maska="##.##.#### ~ ##.##.####" v-model="datePassportExpiration.sV"
              class="border px-2 w-full h-full rounded-md peer" :placeholder="placeholder" type="text">
          </div>
          <span class="ml-12 text-sm text-red-400" v-show="nameInFullFlag">Некорректный ввод</span>
        </label>

      </vue-tailwind-datepicker>

      <label class="relative w-96">
        <span>Место выдачи</span>
        <div class="relative h-10 w-full flex items-center">
          <svg class="h-full py-2 px-3 rounded-l-md bg-gray-200" xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 100 100" fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M20.8335 20.8333C20.8335 19.1389 19.8221 17.6808 18.3701 17.0296C18.9698 16.5573 19.6965 16.234 20.4985 16.1194L65.4885 9.69225C70.5085 8.97508 75.0002 12.8706 75.0002 17.9418V21.3584C73.6685 21.0156 72.2722 20.8333 70.8335 20.8333H20.8335ZM40.625 54.1666C40.625 48.9891 44.8225 44.7916 50 44.7916C55.1775 44.7916 59.375 48.9891 59.375 54.1666C59.375 59.3441 55.1775 63.5416 50 63.5416C44.8225 63.5416 40.625 59.3441 40.625 54.1666ZM83.3332 37.5C83.3332 32.0575 79.8548 27.4273 74.9998 25.7113C73.6965 25.2507 72.294 25 70.8332 25H20.8332C19.2909 25 17.9444 24.1621 17.2239 22.9167C16.8694 22.3038 16.6665 21.5923 16.6665 20.8334V79.1667C16.6665 86.0705 22.263 91.6667 29.1665 91.6667H70.8332C77.7369 91.6667 83.3332 86.0705 83.3332 79.1667V37.5ZM34.3748 54.1667C34.3748 45.5371 41.3704 38.5417 49.9998 38.5417C58.6294 38.5417 65.6248 45.5371 65.6248 54.1667C65.6248 62.7963 58.6294 69.7917 49.9998 69.7917C41.3704 69.7917 34.3748 62.7963 34.3748 54.1667ZM38.5415 79.1667C38.5415 77.4409 39.9406 76.0417 41.6665 76.0417H58.3332C60.059 76.0417 61.4582 77.4409 61.4582 79.1667C61.4582 80.8925 60.059 82.2917 58.3332 82.2917H41.6665C39.9406 82.2917 38.5415 80.8925 38.5415 79.1667Z"
              fill="black" />
          </svg>
          <input v-model="placeIssue" class="border px-2 w-full h-full rounded-r-md peer"
            placeholder="Введите место выдачи (на узбекском)" type="text">
        </div>
      </label>

    </div> -->
  </div>
</template>

<script lang="ts" setup>

const dateBirthVal = ref({
  gV: '',
  sV: '',
});

// const avatar = ref<File>();

const data = defineModel<PassportDetails>({ required: true });
// data.value.birth_date = dateBirthVal.value.sV;

// const data = ref<PassportDetails>({
//   last_name: '',
//   first_name: '',
//   middle_name: '',
//   date_birth: dateBirthVal.value.gV,
//   gender: 'Выберите пол',
//   series_and_number: '',
//   pinfl: '',
// });

const dropdown = ref(false);
const dateFlag = ref(false);
const nameInFullFlag = ref(false);

const options = {
  preProcess: (val: string) => val.toUpperCase(),
}

const clickDropdown = () => {
  dropdown.value = !dropdown.value;
}

const selectOption = (value: string) => {
  data.value.gender = value;
}

const handleDateFocusout = (e: Event) => {
  if (data.value.birth_date === '') dateFlag.value = false;
  else dateFlag.value = !/^(0[1-9]|[12][0-9]|3[01])\.(0[1-9]|1[0-2])\.(19[5-9]\d|20\d{2})$/.test(data.value.birth_date);
}

const changeFullNameFields = (event: Event) => {
  const target = event.target as HTMLInputElement;

  // target.value = target.value.replace(/[^[a-z]|^[а-я]]+/gi, '');

  if (target.value.length !== 0) {
    nameInFullFlag.value = !/^[a-z]+$|^[а-я]+$/i.test(
      data.value.last_name +
      data.value.first_name +
      data.value.middle_name
    );
  } else {
    nameInFullFlag.value = false;
  }
}

</script>

<style></style>